"""
Напишіть програму для обліку читача у бібліотеці.
Облік здійснюється з допомогою словника. При вході в програму одразу виводиться інформація про користувача.
У словнику мають бути ключі: (1 бал)

-                ID (номер по списку)

-                прізвище;

-                Ім’я

-                Група

-                Курс

-                Книги (борг) - список

-                Статистика книг – список

У списку борг зберігаються назви книг які взяв користувач у користування.
У списку статистика зберігаються усі книги які брав користувач і повернув (можуть повторюватися)

Функціонал:

Зробити цикл який буде працювати доки користувач не введе 0 (вихід з циклу) (1 бал)

Якщо користувач введе 1 то програма видає карту читача (1 бал)

Якщо користувач введе 2 то програма пропонує взяти книгу. Користувач має ввести назву книги після чого книга записується в борг. (1 бал)

Якщо користувач вводить 3 то програма пропонує повернути книгу (попередньо виводиться список книг у боргу). Якщо книг немає - виводиться відповідне повідомлення. Якщо книга відсутня у списку - виводиться відповідне повідомлення. Якщо книга є у списку то така книга видаляється зі списку борг і записується у список статистика. (1 бал)

Дані користувача це Ваші особисті дані (і мають збігатися з  журналом)

Програму зберегти на GITHUB посилання прикріпити в СДО
"""

users={
        "id":9,
        "прізвище":"Когут",
        "ім'я":"Богдан",
        "група":"ІПЗс-23-2",
        "книги":[],
        "cтатистика книг":[]
}

for key in users:
    print("{key}:{value}".format(key=key, value=users[key]))

while True:
    number=float(input())
    if(number==1):
        print("Карта читача")
        for key in users:
            print("{key}:{value}".format(key=key,value=users[key]))
    elif(number==2):
        print("Хочете взяти книгу")
        book=input("Книга яку ви хочете взяти:")
        print(book)
        users["книги"].append(book)
    elif(number==3):
        print("поверніть книгу")
        book = input("Книгу яку ви хочете віддати:")
        users["книги"] = list(filter(lambda elem: elem != book, users["книги"]))
        users["cтатистика книг"].append(book)
        if(users["книги"]):
            print("Книги що ви не віддали")
            for book in users["книги"]:
                print(book)
        else:
            print("ввас немає боргу")
    elif(number==0):
        break